Tekla Open API Reference for Tekla Structures 2025
StructuresFieldAttribute.AttributeName Property
 The name of the attribute.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AttributeName { get; }
Public ReadOnly Property AttributeName As String
	Get
Property Value
Type: String
See Also
Reference
StructuresFieldAttribute Class
Tekla.Structures.Plugins Namespace